app/controllers/pages_controller.rb

SELECT  "pols".* FROM "pols" INNER JOIN "pols_users" ON "pols"."id" = "pols_users"."pol_id" WHERE "pols_users"."user_id" = $1 AND "pols"."id" = 2 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def home
    @user = current_user
    if @user != nil
      @user_check = @user.pols.find_by(id: @user)

SELECT  "pols".* FROM "pols" WHERE "pols"."name_first" = $1 AND "pols"."name_last" = $2 LIMIT $3  [["name_first", "test"], ["name_last", "test"], ["LIMIT", 1]]
INSERT INTO "pols_users" ("pol_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["pol_id", 1], ["user_id", 3]]
---
  def display_selection

    require 'open-uri'

    @name1 = params[:name1].upcase
    if @name1 == nil
      @name1 = "empty"
    end

    @name2 = params[:name2].upcase
    if @name2 == nil
      @name2 = "empty"
    end

    @name_selected = @name1 + " " + @name2
    @user = current_user

    @pol = Pol.find_by(name_first: @name1, name_last: @name2)

    if @pol != nil
      @outputmsg = "Match found in the site politician database!"
      if @user == nil
        @outputmsg << " However, you'll need to log in or sign up first to track and save your selection."
      else
        @user.pols << @pol